app/controllers/main_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = ?  [["user_id", 1]]
---
	def encrypt
    @msgs = User.find(session[:user_id]).message

INSERT INTO "messages" ("m_message", "m_offset", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["m_message", "fcufcufu"], ["m_offset", 2], ["user_id", 1], ["created_at", "2015-12-07 03:09:33.431532"], ["updated_at", "2015-12-07 03:09:33.431532"]]
---
  def save_message
    if request.xhr?
      params[:user_id] = session[:user_id]
      #Wanted to save the lookup time in the user table for the id since i alrdy have it cached.
      #either way no big gain, given the size of this project but worth noting.
      @msg = Message.new(message_params)
      if @msg.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 29]]
---
  def get_message
    @msg = Message.find_by_id(get_message_params[:message_id])