app/controllers/users_controller.rb

	def create
	  @user = User.new(registration_params)
	  if @user.save
---
INSERT INTO "users" ("email", "password_salt", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)